{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 513, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 512, 513, 3], "dtype": "float32", "filters": 96, "kernel_size": [11, 11], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 27, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.009999999776482582, "decay": 0.0, "momentum": 0.0, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of216.bin", "group1-shard2of216.bin", "group1-shard3of216.bin", "group1-shard4of216.bin", "group1-shard5of216.bin", "group1-shard6of216.bin", "group1-shard7of216.bin", "group1-shard8of216.bin", "group1-shard9of216.bin", "group1-shard10of216.bin", "group1-shard11of216.bin", "group1-shard12of216.bin", "group1-shard13of216.bin", "group1-shard14of216.bin", "group1-shard15of216.bin", "group1-shard16of216.bin", "group1-shard17of216.bin", "group1-shard18of216.bin", "group1-shard19of216.bin", "group1-shard20of216.bin", "group1-shard21of216.bin", "group1-shard22of216.bin", "group1-shard23of216.bin", "group1-shard24of216.bin", "group1-shard25of216.bin", "group1-shard26of216.bin", "group1-shard27of216.bin", "group1-shard28of216.bin", "group1-shard29of216.bin", "group1-shard30of216.bin", "group1-shard31of216.bin", "group1-shard32of216.bin", "group1-shard33of216.bin", "group1-shard34of216.bin", "group1-shard35of216.bin", "group1-shard36of216.bin", "group1-shard37of216.bin", "group1-shard38of216.bin", "group1-shard39of216.bin", "group1-shard40of216.bin", "group1-shard41of216.bin", "group1-shard42of216.bin", "group1-shard43of216.bin", "group1-shard44of216.bin", "group1-shard45of216.bin", "group1-shard46of216.bin", "group1-shard47of216.bin", "group1-shard48of216.bin", "group1-shard49of216.bin", "group1-shard50of216.bin", "group1-shard51of216.bin", "group1-shard52of216.bin", "group1-shard53of216.bin", "group1-shard54of216.bin", "group1-shard55of216.bin", "group1-shard56of216.bin", "group1-shard57of216.bin", "group1-shard58of216.bin", "group1-shard59of216.bin", "group1-shard60of216.bin", "group1-shard61of216.bin", "group1-shard62of216.bin", "group1-shard63of216.bin", "group1-shard64of216.bin", "group1-shard65of216.bin", "group1-shard66of216.bin", "group1-shard67of216.bin", "group1-shard68of216.bin", "group1-shard69of216.bin", "group1-shard70of216.bin", "group1-shard71of216.bin", "group1-shard72of216.bin", "group1-shard73of216.bin", "group1-shard74of216.bin", "group1-shard75of216.bin", "group1-shard76of216.bin", "group1-shard77of216.bin", "group1-shard78of216.bin", "group1-shard79of216.bin", "group1-shard80of216.bin", "group1-shard81of216.bin", "group1-shard82of216.bin", "group1-shard83of216.bin", "group1-shard84of216.bin", "group1-shard85of216.bin", "group1-shard86of216.bin", "group1-shard87of216.bin", "group1-shard88of216.bin", "group1-shard89of216.bin", "group1-shard90of216.bin", "group1-shard91of216.bin", "group1-shard92of216.bin", "group1-shard93of216.bin", "group1-shard94of216.bin", "group1-shard95of216.bin", "group1-shard96of216.bin", "group1-shard97of216.bin", "group1-shard98of216.bin", "group1-shard99of216.bin", "group1-shard100of216.bin", "group1-shard101of216.bin", "group1-shard102of216.bin", "group1-shard103of216.bin", "group1-shard104of216.bin", "group1-shard105of216.bin", "group1-shard106of216.bin", "group1-shard107of216.bin", "group1-shard108of216.bin", "group1-shard109of216.bin", "group1-shard110of216.bin", "group1-shard111of216.bin", "group1-shard112of216.bin", "group1-shard113of216.bin", "group1-shard114of216.bin", "group1-shard115of216.bin", "group1-shard116of216.bin", "group1-shard117of216.bin", "group1-shard118of216.bin", "group1-shard119of216.bin", "group1-shard120of216.bin", "group1-shard121of216.bin", "group1-shard122of216.bin", "group1-shard123of216.bin", "group1-shard124of216.bin", "group1-shard125of216.bin", "group1-shard126of216.bin", "group1-shard127of216.bin", "group1-shard128of216.bin", "group1-shard129of216.bin", "group1-shard130of216.bin", "group1-shard131of216.bin", "group1-shard132of216.bin", "group1-shard133of216.bin", "group1-shard134of216.bin", "group1-shard135of216.bin", "group1-shard136of216.bin", "group1-shard137of216.bin", "group1-shard138of216.bin", "group1-shard139of216.bin", "group1-shard140of216.bin", "group1-shard141of216.bin", "group1-shard142of216.bin", "group1-shard143of216.bin", "group1-shard144of216.bin", "group1-shard145of216.bin", "group1-shard146of216.bin", "group1-shard147of216.bin", "group1-shard148of216.bin", "group1-shard149of216.bin", "group1-shard150of216.bin", "group1-shard151of216.bin", "group1-shard152of216.bin", "group1-shard153of216.bin", "group1-shard154of216.bin", "group1-shard155of216.bin", "group1-shard156of216.bin", "group1-shard157of216.bin", "group1-shard158of216.bin", "group1-shard159of216.bin", "group1-shard160of216.bin", "group1-shard161of216.bin", "group1-shard162of216.bin", "group1-shard163of216.bin", "group1-shard164of216.bin", "group1-shard165of216.bin", "group1-shard166of216.bin", "group1-shard167of216.bin", "group1-shard168of216.bin", "group1-shard169of216.bin", "group1-shard170of216.bin", "group1-shard171of216.bin", "group1-shard172of216.bin", "group1-shard173of216.bin", "group1-shard174of216.bin", "group1-shard175of216.bin", "group1-shard176of216.bin", "group1-shard177of216.bin", "group1-shard178of216.bin", "group1-shard179of216.bin", "group1-shard180of216.bin", "group1-shard181of216.bin", "group1-shard182of216.bin", "group1-shard183of216.bin", "group1-shard184of216.bin", "group1-shard185of216.bin", "group1-shard186of216.bin", "group1-shard187of216.bin", "group1-shard188of216.bin", "group1-shard189of216.bin", "group1-shard190of216.bin", "group1-shard191of216.bin", "group1-shard192of216.bin", "group1-shard193of216.bin", "group1-shard194of216.bin", "group1-shard195of216.bin", "group1-shard196of216.bin", "group1-shard197of216.bin", "group1-shard198of216.bin", "group1-shard199of216.bin", "group1-shard200of216.bin", "group1-shard201of216.bin", "group1-shard202of216.bin", "group1-shard203of216.bin", "group1-shard204of216.bin", "group1-shard205of216.bin", "group1-shard206of216.bin", "group1-shard207of216.bin", "group1-shard208of216.bin", "group1-shard209of216.bin", "group1-shard210of216.bin", "group1-shard211of216.bin", "group1-shard212of216.bin", "group1-shard213of216.bin", "group1-shard214of216.bin", "group1-shard215of216.bin", "group1-shard216of216.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [11, 11, 3, 96], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [96], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [5, 5, 96, 256], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 256, 384], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [384], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 384, 384], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [384], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 384, 256], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32"}, {"name": "dense/kernel", "shape": [50176, 4096], "dtype": "float32"}, {"name": "dense/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [4096, 27], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [27], "dtype": "float32"}]}]}